export const NewsApi: Array<INewsApiJson> = [
    {
        name: `موقف بوتشيتينو من تدريب منتخب إنجلترا`,
        description: "كشف تقرير صحفي بريطاني، عن موقف المدرب الأرجنتيني ماوريسيو بوتشيتينو من تدريب المنتخب الإنجليزي. وكان المدرب جاريث ساوثجيت قد إستقال من تدريب المنتخب الإنجليزي بعد خسارة نهائي اليورو. ووفقاً لما أوردته صحيفة \"ذا صن\" البريطانية، فإن بوتشيتينو برز كمرشح لتولي تدريب الأسود الثلاث. وأضافت الصحيفة أن المدرب منفتح على فكرة تدريب المنتخب الإنجليزي.",
        id: 2334301,
        slug: `موقف-بوتشيتينو-من-تدريب-منتخب-إنجلترا`,
        image: 'https://imgs.ysscores.com/news/640/1931723123552.PNG',
        time: 1722969900
    },
    {
        name: `مفاجأة..محمد صلاح على أعتاب الدوري السعودي`,
        id: 2336243,
        description: "كشفت تقارير صحفية عن تطور جديد بشأن النجم المصري محمد صلاح لاعب ليفربول واحتمالية رحيله لدوري روشن السعودي. وترغب أندية عدة من دوري روشن في الحصول على توقيع محمد صلاح هذا الصيف. وقالت شبكة \"فوتبول إنسايدر\" إن هناك عرضاً رسمياً سيصل لليفربول من دوري روشن من أجل التعاقد مع محمد صلاح. وذكرت التقارير أنه لا تزال أندية دوري روشن تحسم ميزانياتها لذلك فمن المتوقع أن يكون هناك المزيد من النشاط في أواخر فترة الإنتقالات. وأضافت التقارير أن ليفربول سيجد صعوبة في رفض عرضاً ضخماً بقيمة 100 مليون جنيه استرليني للتنازل عن خدمات صلاح هذا الصيف.",
        slug: `مفاجأة-محمد-صلاح-على-أعتاب-الدوري-السعودي`,
        image: 'https://imgs.ysscores.com/news/640/2191723124770.jpg',
        time: 1722960000
    },
    {
        name: `نبأ سار لعشاق برشلونة`,
        description: "زف تقرير صحفي إسباني، مساء اليوم، نبأ سار لعشاق نادي برشلونة، قبل أسابيع قليلة على نهاية سوق الانتقالات هذا الصيف. ووفقاً للمعلومات الواردة من صحيفة \"سبورت\" الكاتالونية، فإن برشلونة عاد إلى قاعدة 1/1، وقام بإبلاغ رابطة الليجا بهذا الأمر. وقاعدة 1/1 تعني أن يكون النادي لديه حرية التصرف الكامل في الأموال التي تأتي إليه من بيع اللاعبين، ولكن برشلونة كان يستخدم تقريباً ربع المبالغ التي تأتي إليه من صفقات البيع (1/4). وفي سياق متصل، أعلن النادي في بيان رسمي توسيع شراكته مع أرامارك كشريك جديد لـBarca Vision وشريك لمشروع \"إسباي برشلونة\". وحصل النادي الكاتالوني على 40 مليون يورو من استديوهات برشلونة المتأخرة، حيث قامت أرامارك بشراء حصة ليبيرو.",
        id: 2331463,
        slug: `نبأ-سار-لعشاق-برشلونة`,
        image: 'https://imgs.ysscores.com/news/640/6211723120352.jpg',
        time: 1722963600
    },
    {
        name: `برشلونة يحدد بديل نيكو ويليامز`,
        description: "حدد نادي برشلونة بديل صفقة التعاقد مع نجم فريق أتلتيك بلباو نيكو ويليامز، الذي يعد هدف النادي الكاتالوني هذا الصيف. وقالت شبكة \"سكاي ألمانيا\" إن برشلونة يخشى من فشله في التعاقد مع النجم الإسباني الشاب. وأضاف المصدر أن برشلونة يضع نجم بايرن ميونيخ كينجسلي كومان كبديل في حال فشل ضم نيكو ويليامز. وسيكون بايرن ميونيخ منفتحاً على بيع النجم الفرنسي هذا الميركاتو.",
        id: 2352002,
        slug: `برشلونة-يحدد-بديل-نيكو-ويليامز`,
        image: 'https://imgs.ysscores.com/news/640/2491723144425.webp',
        time: 1723050000
    },
]

export interface INewsApiJson {
    name: string
    description: string
    id: number,
    slug: string
    image: string
    time: number
}